{"keras_version": "2.1.5", "config": [{"config": {"batch_input_shape": [null, 168, 8], "units": 330, "recurrent_dropout": 0.0, "return_sequences": false, "activation": "tanh", "unroll": false, "stateful": false, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "kernel_regularizer": null, "dropout": 0.0, "trainable": true, "name": "lstm_5", "use_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "return_state": false, "bias_regularizer": null, "dtype": "float32", "recurrent_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "go_backwards": false, "implementation": 1, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"units": 336, "trainable": true, "name": "dense_5", "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}